LingandRX/Elara/sdkconfig.defaults
# ESP32-S3-LCD-1.9 默认配置
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# 控制台使用 USB-Serial/JTAG（与上位机 COM5 通信）
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_UART_CUSTOM is not set

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# SPI RAM (PSRAM) - 关闭，开发板未连接或配置不匹配
# CONFIG_SPIRAM is not set

# LVGL 配置
CONFIG_LV_COLOR_16_SWAP=y

# 字体配置
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
